---
kind: property
id: P:Autodesk.Revit.DB.Outline.IsEmpty
source: html/989ebb7b-34dd-3a36-0122-6d1ec517cfa8.htm
---
# Autodesk.Revit.DB.Outline.IsEmpty Property

Identifies if the outline represents an empty outline.

## Syntax (C#)
```csharp
public bool IsEmpty { get; }
```